trunk/kmn-server/resource/soapGetPatientList.xml

<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" >
    <SOAP-ENV:Body>
        <getPatientList xmlns="http://192.168.13.10:2221/apps/kmn/IntegrasiAlat/">
            <reqKeyword>%dinda%</reqKeyword>
            <reqClinicId>9</reqClinicId>
            <reqPageNumber>1</reqPageNumber>
            <reqRowPerPage>10</reqRowPerPage>
        </getPatientList>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>